Revit 2027 API
BuiltInFailures.ScheduleViewFailures.PanelScheduleDataPanelSlotInconsistency Property
 The template applied to this panel schedule is set to display fewer space than what is needed to display the max amount of circuits set on the equipment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PanelScheduleDataPanelSlotInconsistency { get; }
Public Shared ReadOnly Property PanelScheduleDataPanelSlotInconsistency As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PanelScheduleDataPanelSlotInconsistency {
	FailureDefinitionId^ get ();
}
static member PanelScheduleDataPanelSlotInconsistency : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ScheduleViewFailures Class
Autodesk.Revit.DB Namespace